translate_table = {'а': 'ка', 'и': 'ки', 'р': 'ши', 'ш': 'ли', 'б': 'зу', 'й': 'фу', 'с': 'ари',
                   'щ': 'ни', 'в': 'ру', 'к': 'ме', 'т': 'чи', 'ъ': 'д', 'г': 'джи', 'л': 'та',
                   'у': 'мей', 'ы': 'хе', 'д': 'те', 'м': 'рин', 'ф': 'лу', 'ь': 'ксе', 'н': 'то',
                   'х': 'ри', 'э': 'га', 'ж': 'зу', 'о': 'мо', 'ц': 'ми', 'ю': 'до', 'з': 'з',
                   'п': 'но', 'ч': 'зи', 'я': 'ма', 'е': 'ку', 'ё': 'ку'}

name = input().lower()
japanese_name = ''.join(translate_table[i] for i in name)
japanese_name = japanese_name.capitalize()
print(japanese_name)